garyPenhook/PyAvrOCD/svd/atmega164p.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USART1</name>
      <description>USART</description>
      <baseAddress>0x008000C8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UBRR1</name>
          <description>USART Baud Rate Register  Bytes</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UCSR1A</name>
          <description>USART Control and Status Register A (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPCM1</name>
              <description>Multi-processor Communication Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>U2X1</name>
              <description>Double the USART transmission speed</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UPE1</name>
              <description>Parity Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOR1</name>
              <description>Data overRun</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FE1</name>
              <description>Framing Error</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDRE1</name>
              <description>USART Data Register Empty</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXC1</name>
              <description>USART Transmit Complete</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXC1</name>
              <description>USART Receive Complete</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1B</name>
          <description>USART Control and Status Register B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXB81</name>
              <description>Transmit Data Bit 8</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXB81</name>
              <description>Receive Data Bit 8</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSZ12</name>
              <description>Character Size</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXEN1</name>
              <description>Transmitter Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXEN1</name>
              <description>Receiver Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDRIE1</name>
              <description>USART Data register Empty Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCIE1</name>
              <description>TX Complete Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCIE1</name>
              <description>RX Complete Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCSR1C</name>
          <description>USART Control and Status Register C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>UCPOL1</name>
              <description>Clock Polarity</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSZ1</name>
              <description>Character Size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>3</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>USBS1</name>
              <description>Stop Bit Select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1_BIT</name>
                  <description>1-bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_BIT</name>
                  <description>2-bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPM1</name>
              <description>Parity Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_EVEN_PARITY</name>
                  <description>Enabled, Even Parity</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED_ODD_PARITY</name>
                  <description>Enabled, Odd Parity</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UMSEL1</name>
              <description>USART Mode Select</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNCHRONOUS_USART</name>
                  <description>Asynchronous USART</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCHRONOUS_USART</name>
                  <description>Synchronous USART</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_SPI</name>
                  <description>Master SPI</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR1</name>
          <description>USART I/O Data Register (write-only for debugger)</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
